Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSent_bf.h
/** \brief  Offset for Ifx_SENT_ID_Bits.MODTYPE */
#define IFX_SENT_ID_MODTYPE_OFF (8u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC0 */
#define IFX_SENT_INTOV_IPC0_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC0 */
#define IFX_SENT_INTOV_IPC0_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC0 */
#define IFX_SENT_INTOV_IPC0_OFF (0u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC10 */
#define IFX_SENT_INTOV_IPC10_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC10 */
#define IFX_SENT_INTOV_IPC10_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC10 */
#define IFX_SENT_INTOV_IPC10_OFF (10u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC11 */
#define IFX_SENT_INTOV_IPC11_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC11 */
#define IFX_SENT_INTOV_IPC11_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC11 */
#define IFX_SENT_INTOV_IPC11_OFF (11u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC12 */
#define IFX_SENT_INTOV_IPC12_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC12 */
#define IFX_SENT_INTOV_IPC12_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC12 */
#define IFX_SENT_INTOV_IPC12_OFF (12u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC13 */
#define IFX_SENT_INTOV_IPC13_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC13 */
#define IFX_SENT_INTOV_IPC13_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC13 */
#define IFX_SENT_INTOV_IPC13_OFF (13u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC14 */
#define IFX_SENT_INTOV_IPC14_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC14 */
#define IFX_SENT_INTOV_IPC14_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC14 */
#define IFX_SENT_INTOV_IPC14_OFF (14u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC15 */
#define IFX_SENT_INTOV_IPC15_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC15 */
#define IFX_SENT_INTOV_IPC15_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC15 */
#define IFX_SENT_INTOV_IPC15_OFF (15u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC16 */
#define IFX_SENT_INTOV_IPC16_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC16 */
#define IFX_SENT_INTOV_IPC16_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC16 */
#define IFX_SENT_INTOV_IPC16_OFF (16u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC17 */
#define IFX_SENT_INTOV_IPC17_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC17 */
#define IFX_SENT_INTOV_IPC17_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC17 */
#define IFX_SENT_INTOV_IPC17_OFF (17u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC18 */
#define IFX_SENT_INTOV_IPC18_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC18 */
#define IFX_SENT_INTOV_IPC18_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC18 */
#define IFX_SENT_INTOV_IPC18_OFF (18u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC19 */
#define IFX_SENT_INTOV_IPC19_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC19 */
#define IFX_SENT_INTOV_IPC19_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC19 */
#define IFX_SENT_INTOV_IPC19_OFF (19u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC1 */
#define IFX_SENT_INTOV_IPC1_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC1 */
#define IFX_SENT_INTOV_IPC1_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC1 */
#define IFX_SENT_INTOV_IPC1_OFF (1u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC20 */
#define IFX_SENT_INTOV_IPC20_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC20 */
#define IFX_SENT_INTOV_IPC20_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC20 */
#define IFX_SENT_INTOV_IPC20_OFF (20u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC21 */
#define IFX_SENT_INTOV_IPC21_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC21 */
#define IFX_SENT_INTOV_IPC21_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC21 */
#define IFX_SENT_INTOV_IPC21_OFF (21u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC22 */
#define IFX_SENT_INTOV_IPC22_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC22 */
#define IFX_SENT_INTOV_IPC22_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC22 */
#define IFX_SENT_INTOV_IPC22_OFF (22u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC23 */
#define IFX_SENT_INTOV_IPC23_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC23 */
#define IFX_SENT_INTOV_IPC23_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC23 */
#define IFX_SENT_INTOV_IPC23_OFF (23u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC24 */
#define IFX_SENT_INTOV_IPC24_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC24 */
#define IFX_SENT_INTOV_IPC24_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC24 */
#define IFX_SENT_INTOV_IPC24_OFF (24u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC2 */
#define IFX_SENT_INTOV_IPC2_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC2 */
#define IFX_SENT_INTOV_IPC2_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC2 */
#define IFX_SENT_INTOV_IPC2_OFF (2u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC3 */
#define IFX_SENT_INTOV_IPC3_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC3 */
#define IFX_SENT_INTOV_IPC3_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC3 */
#define IFX_SENT_INTOV_IPC3_OFF (3u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC4 */
#define IFX_SENT_INTOV_IPC4_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC4 */
#define IFX_SENT_INTOV_IPC4_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC4 */
#define IFX_SENT_INTOV_IPC4_OFF (4u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC5 */
#define IFX_SENT_INTOV_IPC5_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC5 */
#define IFX_SENT_INTOV_IPC5_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC5 */
#define IFX_SENT_INTOV_IPC5_OFF (5u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC6 */
#define IFX_SENT_INTOV_IPC6_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC6 */
#define IFX_SENT_INTOV_IPC6_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC6 */
#define IFX_SENT_INTOV_IPC6_OFF (6u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC7 */
#define IFX_SENT_INTOV_IPC7_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC7 */
#define IFX_SENT_INTOV_IPC7_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC7 */
#define IFX_SENT_INTOV_IPC7_OFF (7u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC8 */
#define IFX_SENT_INTOV_IPC8_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC8 */
#define IFX_SENT_INTOV_IPC8_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_INTOV_Bits.IPC8 */
#define IFX_SENT_INTOV_IPC8_OFF (8u)

/** \brief  Length for Ifx_SENT_INTOV_Bits.IPC9 */
#define IFX_SENT_INTOV_IPC9_LEN (1u)

/** \brief  Mask for Ifx_SENT_INTOV_Bits.IPC9 */
#define IFX_SENT_INTOV_IPC9_MSK (0x1u)

